app/controllers/movies_controller.rb

  def checkpwd
    uni = user_params[:uni]
    password = user_params[:password]

    @user = User.find(uni)
---
SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "lx2301"]]

  def create#_user
    # @user = Users.create!(user_params)
    @user = User.create(user_params) #Ref: https://stackoverflow.com/questions/23975835/ruby-on-rails-active-record-return-value-when-create-fails
---
INSERT INTO "users" ("uni", "password", "uname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uni", "qq1000"], ["password", "123456"], ["uname", "qq1000"], ["created_at", "2022-10-29 22:04:13.656213"], ["updated_at", "2022-10-29 22:04:13.656213"]]