app/controllers/users_controller.rb

  def show
    uni = params[:id] # retrieve user ID(uni) from URI route
    @user = User.find(uni) # look up user by unique ID
---
SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "aa1000"]]

  def checkpwd
    uni = user_params[:uni]
    password = user_params[:password]

    @user = User.find_by(uni: uni)
---
SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "aa1000"]]

  def create#_user
    # @user = Users.create!(user_params)
    # if User.exists?(uni:params[:user][:uni])
    #   flash[:warning] = "Account creation failed. Please check if UNI is already registered."
    #   render :action => 'signup'
    # end
    @user = User.create(create_user_params) #Ref: https://stackoverflow.com/questions/23975835/ruby-on-rails-active-record-return-value-when-create-fails
---
INSERT INTO "users" ("uni", "password", "uname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["uni", "jc5897"], ["password", "1234"], ["uname", "Jiawen"], ["created_at", "2022-10-30 22:46:52.459926"], ["updated_at", "2022-10-30 22:46:52.459926"]]

  def update
    @user = User.find params[:uni]
    @user.update_attributes!(update_params)
---
SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "uni"]]
UPDATE "users" SET "lionmail" = ?, "phone" = ?, "contact" = ?, "time_slot" = ?, "description" = ?, "skills" = ?, "updated_at" = ? WHERE "users"."uni" = ?  [["lionmail", "jc5897.com"], ["phone", ""], ["contact", ""], ["time_slot", "Monday"], ["description", ""], ["skills", ""], ["updated_at", "2022-10-31 00:48:15.435439"], ["uni", "jc5897"]]

  def course
    @user = User.find params[:uni]
---
SELECT  "users".* FROM "users" WHERE "users"."uni" = ? LIMIT 1  [["uni", "aa1000"]]